In [1]:
import pandas as pd
import numpy as np
import io
import statsmodels.formula.api as smf

In [2]:
data = '''sleep totwrk age male hrwage
3113   3438  32   1    7.07 
2920   5020  31   1    1.43 
2670   2815  44   1   20.53 
3083   3786  30   0    9.62 
3448   2580  64   1    2.75 
4063   1205  41   1   19.25 '''

In [4]:
df = pd.read_csv(io.StringIO(data), sep='\s+')
df

   sleep  totwrk  age  male  hrwage
0   3113    3438   32     1    7.07
1   2920    5020   31     1    1.43
2   2670    2815   44     1   20.53
3   3083    3786   30     0    9.62
4   3448    2580   64     1    2.75
5   4063    1205   41     1   19.25

In [5]:
df ['pred'] = 3525.14  -0.16*df['totwrk']+1.62*df['age']+51.84*df['male']-9.88*np.log(df['hrwage'])
df

   sleep  totwrk  age  male  hrwage         pred
0   3113    3438   32     1    7.07  3059.416098
1   2920    5020   31     1    1.43  2820.466176
2   2670    2815   44     1   20.53  3168.003754
3   3083    3786   30     0    9.62  2945.613219
4   3448    2580   64     1    2.75  3257.865383
5   4063    1205   41     1   19.25  3421.379791

In [6]:
df['residual']=df['sleep']-df['pred']
df

   sleep  totwrk  age  male  hrwage         pred    residual
0   3113    3438   32     1    7.07  3059.416098   53.583902
1   2920    5020   31     1    1.43  2820.466176   99.533824
2   2670    2815   44     1   20.53  3168.003754 -498.003754
3   3083    3786   30     0    9.62  2945.613219  137.386781
4   3448    2580   64     1    2.75  3257.865383  190.134617
5   4063    1205   41     1   19.25  3421.379791  641.620209

# 1.1.2

In [7]:
import pandas as pd
import numpy as np
import io
import statsmodels.formula.api as smf

In [8]:
data_spring='''output capital labour
9.25    2.61    184  
3.66    1.32     91  
28.78   22.09   426  
4.12    10.74    72  
2.89    1.16     46  '''

In [9]:
df = pd.read_csv(io.StringIO(data_spring), sep='\s+')
df

   output  capital  labour
0    9.25     2.61     184
1    3.66     1.32      91
2   28.78    22.09     426
3    4.12    10.74      72
4    2.89     1.16      46

In [10]:
df['y_pred'] =  -1.71  + np.log(df['capital'])*(0.21) + np.log(df['labour'])*(0.71)
df

   output  capital  labour    y_pred
0    9.25     2.61     184  2.194068
1    3.66     1.32      91  1.551013
2   28.78    22.09     426  3.238628
3    4.12    10.74      72  1.824968
4    2.89     1.16      46  1.039504

In [11]:
df['residual']=np.log(df['output'])-df['y_pred']
df. round (2)

   output  capital  labour  y_pred  residual
0    9.25     2.61     184    2.19      0.03
1    3.66     1.32      91    1.55     -0.25
2   28.78    22.09     426    3.24      0.12
3    4.12    10.74      72    1.82     -0.41
4    2.89     1.16      46    1.04      0.02

# 1.2.1

In [12]:
TSS=100.35
ESS=47.56

In [30]:
RSS = TSS - ESS
round (RSS,2)

52.79

In [29]:
R2 = ESS/TSS
round(R2,2)

0.47

$$
R2 = 0.47; RSS = 52.79
$$

# 1.2.4

In [15]:
import numpy as np
import pandas as pd
import io
import statsmodels.formula.api as smf

In [28]:
data_spring = '''остаток 
-0.24  
0.41  
1.22 
-0.93 
-0.37 
-1.33  
0.16 
-0.27  
0.06  
1.29'''
df = pd.read_csv(io.StringIO(data_spring), sep='\s+')
df

   остаток
0    -0.24
1     0.41
2     1.22
3    -0.93
4    -0.37
5    -1.33
6     0.16
7    -0.27
8     0.06
9     1.29

In [24]:
RSS = np.sum((df)**2)
round (RSS, 2)

остаток    6.25
dtype: float64

In [25]:
s = (RSS/(10-2))**0.5
round (s, 2)

остаток    0.88
dtype: float64

# 1.2.5

In [33]:
data_spring='''sleep totwrk age y.hat
51.88     3438  32  51.00
48.67     5020  31  44.43
44.50     2815  44  53.72
51.38     3786  30  49.53
57.47     2580  64  54.92
67.72     1205  41  60.36
53        2113  35  56.53
48.80     3608  47  50.46
56.13     2353  32  55.50
50.30     2851  30  53.41
'''
df = pd.read_csv(io.StringIO(data_spring), sep='\s+')
df

   sleep  totwrk  age  y.hat
0  51.88    3438   32  51.00
1  48.67    5020   31  44.43
2  44.50    2815   44  53.72
3  51.38    3786   30  49.53
4  57.47    2580   64  54.92
5  67.72    1205   41  60.36
6  53.00    2113   35  56.53
7  48.80    3608   47  50.46
8  56.13    2353   32  55.50
9  50.30    2851   30  53.41

In [34]:
RSS = ((df['sleep'] - df['y.hat'])**2).sum()
RSS.round(2)

193.14

In [36]:
TSS = ((df['sleep'] - np.mean(df['sleep']))**2).sum()
TSS.round(2)

366.26

In [37]:
ESS = TSS-RSS
ESS.round(2)

173.12

# 1.2.6

In [38]:
data_spring = '''log(output) log(capital) log(labour) y.hat
2.22            0.96        5.21     2.19 
1.30            0.28        4.51     1.47 
3.36            3.10        6.05     3.23 
1.42            2.37        4.28     1.56 
1.06            0.15        3.83     0.85 
6.17            5.62        8.94     6.15 
0.77            0.52        3.87     0.94 
1.42            0.15        4.68     1.61 
0.90           -0.13        3.56     0.57 
1.35            1.25        4.28     1.40 '''
df = pd.read_csv(io.StringIO(data_spring), sep='\s+')
df

   log(output)  log(capital)  log(labour)  y.hat
0         2.22          0.96         5.21   2.19
1         1.30          0.28         4.51   1.47
2         3.36          3.10         6.05   3.23
3         1.42          2.37         4.28   1.56
4         1.06          0.15         3.83   0.85
5         6.17          5.62         8.94   6.15
6         0.77          0.52         3.87   0.94
7         1.42          0.15         4.68   1.61
8         0.90         -0.13         3.56   0.57
9         1.35          1.25         4.28   1.40

In [39]:
TSS = ((df['log(output)'] - np.mean(df['log(output)']))**2).sum()
TSS.round(2)

24.48

In [40]:
RSS = ((df['log(output)'] - df['y.hat'])**2).sum()
RSS.round(2)

0.29

In [41]:
ESS = TSS-RSS
ESS.round(2)

24.19

# 1.2.7

In [42]:
RSE = 0.378
n = 935
m = 6
RSS = RSE**2*(n-m)
round(RSS, 3)

132.739

# 1.2.8

In [43]:
RSE = 0.383
R2 = 0.178
n = 935
m = 5
RSS = RSE**2*(n-m)
TSS = RSS/(1-R2)
round(TSS, 3)

165.962

# 1.2.9

In [44]:
RSE = 0.389
R2 = 0.149
n = 935
m = 4
RSS = RSE**2*(n-m)
TSS = RSS/(1-R2)
ESS = TSS - RSS
round(ESS, 3)

24.666

# 2.1

$$
R^2adj = 1 - (1-R^2)*((n-1)/(n-k))
$$

In [45]:
n = 526
k = 5
R2 = 0.288
R2adj = 1 - (1- R2)*(n-1)/(n-k)
R2adj

0.2825335892514397

# 2.3

In [46]:
data_spring='''sleep/60 totwrk age y.hat
51.88     3438  32  51.00
48.67     5020  31  44.43
44.50     2815  44  53.72
51.38     3786  30  49.53
57.47     2580  64  54.92
67.72     1205  41  60.36
53        2113  35  56.53
48.80     3608  47  50.46
56.13     2353  32  55.50
50.30     2851  30  53.41
'''
df = pd.read_csv(io.StringIO(data_spring), sep='\s+')
df

   sleep/60  totwrk  age  y.hat
0     51.88    3438   32  51.00
1     48.67    5020   31  44.43
2     44.50    2815   44  53.72
3     51.38    3786   30  49.53
4     57.47    2580   64  54.92
5     67.72    1205   41  60.36
6     53.00    2113   35  56.53
7     48.80    3608   47  50.46
8     56.13    2353   32  55.50
9     50.30    2851   30  53.41

In [47]:
TSS = ((df['sleep/60'] - np.mean(df['sleep/60']))**2).sum()
ESS = ((df['y.hat']- np.mean(df['sleep/60']))**2).sum()
R2 = ESS/TSS
R2.round(2)

0.47

In [48]:
RSS = TSS - ESS
n = len(df)
k = 3
RSS_adj = 1 - (RSS/TSS)*((n-1)/(n-k))
RSS_adj.round(2)

0.32

In [50]:
data_spring='''log(output) log(capital) log(labour) y.hat
2.22            0.96        5.21     2.19 
1.30            0.28        4.51     1.47 
3.36            3.10        6.05     3.23 
1.42            2.37        4.28     1.56 
1.06            0.15        3.83     0.85 
6.17            5.62        8.94     6.15 
0.77            0.52        3.87     0.94 
1.42            0.15        4.68     1.61 
0.90           -0.13        3.56     0.57 
1.35            1.25        4.28     1.40
'''
df = pd.read_csv(io.StringIO(data_spring), sep='\s+')
df

   log(output)  log(capital)  log(labour)  y.hat
0         2.22          0.96         5.21   2.19
1         1.30          0.28         4.51   1.47
2         3.36          3.10         6.05   3.23
3         1.42          2.37         4.28   1.56
4         1.06          0.15         3.83   0.85
5         6.17          5.62         8.94   6.15
6         0.77          0.52         3.87   0.94
7         1.42          0.15         4.68   1.61
8         0.90         -0.13         3.56   0.57
9         1.35          1.25         4.28   1.40

In [51]:
TSS = ((df['log(output)'] - np.mean(df['log(output)']))**2).sum()
ESS = ((df['y.hat']- np.mean(df['log(output)']))**2).sum()
R2 = ESS/TSS
R2.round(2)

0.99

In [52]:
RSS = TSS - ESS
n = len(df)
k = 2
RSS_adj = 1 - (RSS/TSS)*((n-1)/(n-k))
RSS_adj.round(2)

0.99

# 3.1

In [54]:
spring_data = '''i   Факт  Fitted  Остаток 
1   3113 3094.454  18.546 
4   3083 2943.580 139.420 
6   4063 3494.143 568.857 
10  3018 3111.983 -93.983 
508 3630 3476.914 153.086 
700 2993 3295.398 -302.398'''
df = pd.read_csv(io.StringIO(spring_data), sep='\s+')
df

     i  Факт    Fitted  Остаток
0    1  3113  3094.454   18.546
1    4  3083  2943.580  139.420
2    6  4063  3494.143  568.857
3   10  3018  3111.983  -93.983
4  508  3630  3476.914  153.086
5  700  2993  3295.398 -302.398

In [55]:
df['Факт'].mean()

3316.6666666666665

In [56]:
TSS = np.sum((df['Факт']-df['Факт'].mean())**2)
TSS

945233.3333333334

In [57]:
df['Fitted'].mean()

3236.078666666667

In [58]:
ESS = np.sum((df['Fitted']-df['Факт'].mean())**2)
ESS

288096.9463873332

In [59]:
RSS = TSS - ESS
RSS

657136.3869460002

In [60]:
R2 = ESS/TSS
R2

0.30478923692985843

# 3.2

In [64]:
we_have = '''i   Факт  Fitted  Остаток 
1   2670 3132.491 -462.491
9   3090 3370.083 -280.083
56  2985 2835.360 149.640 
76  3660 3248.540 411.460 
100 2618 2863.070 -245.070'''
we_have
df=pd.read_csv(io.StringIO(we_have), sep='\s+')
df

     i  Факт    Fitted  Остаток
0    1  2670  3132.491 -462.491
1    9  3090  3370.083 -280.083
2   56  2985  2835.360  149.640
3   76  3660  3248.540  411.460
4  100  2618  2863.070 -245.070

In [65]:
df['Факт'].mean()

3004.6

In [66]:
TSS=np.sum((df['Факт']-df['Факт'].mean())**2)
TSS

698643.2

In [67]:
df['Fitted'].mean()

3089.9088

In [68]:
ESS=np.sum((df['Fitted']-df['Факт'].mean())**2)
ESS

258113.57327000005

In [69]:
RSS=TSS-ESS
RSS

440529.6267299999

In [70]:
R2 = ESS/TSS
R2

0.36944977532165213